---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.BumpmapType
source: html/8c5baa8e-1550-ac54-c41e-a45efad95bfd.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.BumpmapType Property

The property labeled "Bump Type" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string BumpmapType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "BumpmapType".